# GetLayerWidth Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetLayerWidth Method
CompoundStructure Class See Also
---
Retrieves the width of a specified layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GetLayerWidth(
	int layerIdx
)
```

Visual Basic
---
```text
Public Function GetLayerWidth ( _
	layerIdx As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetLayerWidth(
	int layerIdx
)
```

# ### Parameters
layerIdx
    Type: System..::..Int32 Index of a layer in the CompoundStructure.
# ### Return Value
The width of the specified layer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The layer index is out of range. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace